// 객체 타입
var num = 10; //숫자
var myName = "홍길동"; //문자열
var str; //undefined
////////////////////////
// 1. 숫자(number)
var firstNum = 10; //소수점을 사용하지 않은 표현
var secondNum = 10.0; //소수점을 사용한 표현
var thirdNum = 10e6; //10000000
var fourthNum = 10e-6; //0.00001
//e는 10을 주어진 숫자 만큼 추가로 곱하거나 나눠준다
///////////////////////////////
//2. 문자열(string)
var firstStr = "이것도 문자열입니다.";
var secondStr = "이것도 문자열입니다.";
var thirdStr = "나의 이름은 '홍길동'이야.";
var fourthStr = '나의 이름은 "홍길동"이야.';
//> 문자열을 표현하는데 큰따움표와 작은 따움표는 상관없다
//>> 하지만, 큰따옴표 안에는 작은따옴표 / 작은따옴표 안에는 큰따옴표를 써줘야한다.
